{
  "cookieManagement": {
    "title": "Gestion des Cookies",
    "description": "Contrôlez votre vie privée sur LexOrbital. Choisissez quels cookies nous pouvons utiliser pour améliorer votre expérience.",
    "activeCookies": {
      "title": "Cookies actuellement actifs",
      "subtitle": "Nombre total de cookies autorisés sur ce site"
    },
    "whatIsCookie": {
      "title": "Qu'est-ce qu'un cookie ?",
      "paragraph1": "Les cookies sont de petits fichiers texte stockés sur votre appareil lorsque vous visitez un site web. Ils permettent au site de mémoriser vos actions et préférences sur une période donnée.",
      "paragraph2": "LexOrbital n'est pas conçu pour collecter des données personnelles sensibles. Nous utilisons uniquement des cookies essentiels au fonctionnement du site et, avec votre consentement, des cookies pour améliorer votre expérience."
    },
    "categories": {
      "title": "Catégories de cookies",
      "necessary": {
        "title": "🔵 Cookies Nécessaires",
        "subtitle": "(Obligatoire)",
        "description": "Ces cookies sont indispensables au fonctionnement du site. Ils ne peuvent pas être désactivés car ils assurent des fonctions essentielles comme la sécurité et l'authentification.",
        "cookies": {
          "session": {
            "name": "lexorbital-session",
            "purpose": "Session utilisateur",
            "duration": "Session"
          },
          "language": {
            "name": "lexorbital-language",
            "purpose": "Préférence de langue FR/EN",
            "duration": "1 an"
          },
          "consent": {
            "name": "lexorbital-cookie-consent",
            "purpose": "Vos préférences de cookies",
            "duration": "1 an"
          }
        }
      },
      "functional": {
        "title": "🟢 Cookies Fonctionnels",
        "subtitle": "(Optionnel)",
        "description": "Ces cookies améliorent votre expérience en mémorisant vos préférences et choix (thème, disposition de l'interface).",
        "cookies": {
          "theme": {
            "name": "lexorbital-theme",
            "purpose": "Préférence de thème visuel",
            "duration": "1 an"
          },
          "sidebar": {
            "name": "lexorbital-sidebar-state",
            "purpose": "État de la barre latérale (ouvert/fermé)",
            "duration": "30 jours"
          }
        }
      },
      "analytics": {
        "title": "🟠 Cookies Analytiques",
        "subtitle": "(Optionnel)",
        "description": "Ces cookies collectent des données anonymes sur l'utilisation du site pour nous aider à améliorer nos services et comprendre comment les utilisateurs interagissent avec LexOrbital.",
        "cookies": {
          "ga": {
            "name": "_ga",
            "purpose": "Google Analytics - Identifiant utilisateur unique",
            "duration": "2 ans"
          },
          "gaSession": {
            "name": "_ga_*",
            "purpose": "Google Analytics - Données de session",
            "duration": "2 ans"
          }
        }
      },
      "marketing": {
        "title": "🔴 Cookies Marketing",
        "subtitle": "(Optionnel)",
        "description": "Ces cookies seraient utilisés pour afficher des publicités pertinentes. LexOrbital n'utilise actuellement aucun cookie marketing."
      }
    },
    "actions": {
      "acceptAll": "Tout Accepter",
      "acceptAllAria": "Accepter tous les cookies",
      "rejectAll": "Tout Refuser",
      "rejectAllAria": "Refuser tous les cookies optionnels",
      "save": "Enregistrer mes Choix",
      "saveAria": "Enregistrer mes préférences",
      "note": "Vous pouvez modifier vos préférences à tout moment en revenant sur cette page."
    },
    "cookieDetails": {
      "used": "Cookies utilisés :",
      "duration": "Durée :",
      "none": "Aucun cookie",
      "count": "{{count}} cookie",
      "count_plural": "{{count}} cookies",
      "showDetails": "Voir détails",
      "hideDetails": "Masquer détails"
    },
    "legal": {
      "title": "Informations légales",
      "retention": {
        "title": "Durée de conservation",
        "description": "Les cookies sont conservés pour la durée indiquée dans chaque catégorie. À l'expiration, ils sont automatiquement supprimés."
      },
      "recipients": {
        "title": "Destinataires des données",
        "description": "Seul LexOrbital a accès aux données des cookies nécessaires et fonctionnels. Les cookies analytiques peuvent être partagés avec Google Analytics (anonymisé)."
      },
      "gdpr": {
        "title": "Vos droits RGPD",
        "description": "Vous disposez d'un droit d'accès, de rectification, de suppression et d'opposition au traitement de vos données personnelles. Pour exercer ces droits, consultez notre page Contact."
      }
    },
    "modal": {
      "title": "Préférences enregistrées",
      "message": "Vos préférences de cookies ont été enregistrées avec succès. {{count}} cookie est actuellement actif.",
      "message_plural": "Vos préférences de cookies ont été enregistrées avec succès. {{count}} cookies sont actuellement actifs.",
      "close": "Fermer",
      "closeAria": "Fermer"
    }
  },
  "termsOfUse": {
    "title": "Conditions d'utilisation",
    "version": {
      "version": "Version 1.2",
      "effectiveDate": "Date d'entrée en vigueur : 7 décembre 2025",
      "current": "Actuel"
    },
    "tableOfContents": {
      "title": "Table des matières :",
      "object": "1. Objet et portée",
      "access": "2. Accès et utilisation",
      "ip": "3. Propriété intellectuelle",
      "liability": "4. Limitations de responsabilité",
      "modifications": "5. Modifications",
      "data": "6. Protection des données",
      "termination": "7. Résiliation"
    },
    "sections": {
      "object": {
        "title": "1. Objet et portée",
        "paragraph1": "Ces Conditions d'utilisation régissent l'accès et l'utilisation de la plateforme et des services LexOrbital. En accédant à cette plateforme, les utilisateurs reconnaissent avoir lu et accepté ces conditions dans leur intégralité.",
        "paragraph2": "LexOrbital est une plateforme de visualisation de l'évolution de l'architecture logicielle et des interactions entre modules. Le service est fourni sur la base d'un abonnement avec différents niveaux d'accès selon le rôle de l'utilisateur."
      },
      "access": {
        "title": "2. Accès et utilisation",
        "description": "L'accès à la plateforme nécessite une authentification utilisateur. Les utilisateurs sont responsables de :",
        "items": {
          "credentials": "• Maintenir la confidentialité de leurs identifiants",
          "equipment": "• S'assurer que leur équipement répond aux exigences techniques",
          "laws": "• Utiliser la plateforme conformément aux lois applicables",
          "security": "• Ne pas tenter de contourner les mesures de sécurité"
        }
      },
      "ip": {
        "title": "3. Propriété intellectuelle",
        "description": "Tout le contenu, la structure, les éléments de design et le code logiciel de la plateforme LexOrbital sont protégés par des droits de propriété intellectuelle. Sauf autorisation explicite :",
        "items": {
          "reproduce": "• Les utilisateurs ne peuvent pas reproduire, modifier ou distribuer le contenu de la plateforme",
          "proprietary": "• L'architecture modulaire et le cadre conceptuel restent propriétaires",
          "api": "• L'accès à l'API est régi par des accords de licence séparés",
          "opensource": "• Les composants open-source sont régis par leurs licences respectives (voir Références)"
        }
      },
      "liability": {
        "title": "4. Limitations de responsabilité",
        "description": "LexOrbital s'efforce de fournir un service fiable mais ne garantit pas concernant :",
        "items": {
          "availability": "• La disponibilité continue et ininterrompue (les conditions SLA s'appliquent séparément)",
          "accuracy": "• L'exactitude ou l'exhaustivité des visualisations (les données sont fournies telles quelles)",
          "compatibility": "• La compatibilité avec tous les systèmes tiers",
          "outcomes": "• Les résultats découlant des décisions architecturales prises en utilisant les informations de la plateforme"
        },
        "acknowledgment": "Les utilisateurs reconnaissent que LexOrbital est un outil d'analyse et de visualisation, et non un substitut à une consultation architecturale professionnelle."
      },
      "modifications": {
        "title": "5. Modifications",
        "description": "LexOrbital se réserve le droit de modifier ces Conditions d'utilisation à tout moment. Les utilisateurs seront informés des modifications importantes via :",
        "items": {
          "email": "• Notification par email au compte enregistré",
          "banner": "• Bannière de notification dans la plateforme",
          "trustCenter": "• Mise à jour publiée dans le Centre de confiance"
        },
        "acceptance": "L'utilisation continue de la plateforme après notification constitue une acceptation des conditions modifiées. Les utilisateurs qui ne sont pas d'accord peuvent résilier leur compte comme décrit à la section 7."
      },
      "data": {
        "title": "6. Protection des données",
        "description": "Les données utilisateur sont traitées conformément à notre Politique de confidentialité et aux réglementations applicables en matière de protection des données (RGPD, CCPA). Principes clés :",
        "items": {
          "minimal": "• Collecte minimale de données (uniquement ce qui est nécessaire pour la fourniture du service)",
          "transparent": "• Traitement transparent (voir la Politique de confidentialité pour plus de détails)",
          "rights": "• Droits des utilisateurs (accès, rectification, suppression, portabilité)",
          "security": "• Stockage et transmission sécurisés (chiffrement au repos et en transit)"
        },
        "contact": "Pour les demandes de protection des données, contactez :",
        "email": "privacy@lexorbital.com",
        "emailLabel": "Envoyer un email à privacy@lexorbital.com"
      },
      "termination": {
        "title": "7. Résiliation",
        "description": "Les utilisateurs peuvent résilier leur compte à tout moment via les paramètres du compte. Lors de la résiliation :",
        "items": {
          "access": "• L'accès à la plateforme cessera immédiatement",
          "deletion": "• Les données utilisateur seront supprimées dans les 30 jours (sauf si la rétention légale est requise)",
          "refund": "• Les frais d'abonnement prépayés ne sont pas remboursables (base au prorata)"
        },
        "suspension": "LexOrbital peut suspendre ou résilier les comptes pour violation de ces Conditions, avec notification lorsque cela est possible."
      }
    },
    "contact": {
      "title": "Questions ou préoccupations",
      "description": "Pour toute question concernant ces Conditions d'utilisation, veuillez contacter notre service juridique :",
      "email": "legal@lexorbital.com",
      "emailLabel": "Envoyer un email à legal@lexorbital.com"
    }
  },
  "ecoConception": {
    "title": "Principes d'Éco-conception",
    "sustainability": {
      "title": "Approche de Durabilité Numérique",
      "paragraph1": "LexOrbital V1 a été conçu en tenant compte de l'impact environnemental, en suivant les principes de l'éco-conception numérique pour minimiser la consommation de ressources et l'utilisation d'énergie.",
      "paragraph2": "L'approche minimaliste et structurelle sert à la fois des objectifs fonctionnels et environnementaux, réduisant les transferts de données inutiles et la surcharge computationnelle."
    },
    "strategies": {
      "title": "Stratégies d'Implémentation",
      "items": {
        "visualComplexity": {
          "title": "Complexité Visuelle Minimale",
          "description": "Le schéma de couleurs noir et blanc élimine le traitement de couleurs inutile. Aucune image, dégradé ou effet visuel complexe ne réduit les exigences de rendu."
        },
        "codeStructure": {
          "title": "Structure de Code Optimisée",
          "description": "L'architecture modulaire empêche la duplication de code. Le HTML sémantique réduit la surcharge de balisage. Aucune dépendance externe pour les effets visuels ou les animations."
        },
        "typography": {
          "title": "Typographie Efficace",
          "description": "Une seule famille de polices (Roboto) minimise le chargement des polices. Les polices système réduisent les demandes de ressources externes."
        },
        "staticContent": {
          "title": "Priorité au Contenu Statique",
          "description": "V1 se concentre sur le contenu statique qui peut être efficacement mis en cache et servi avec un traitement serveur minimal."
        }
      }
    },
    "metrics": {
      "title": "Métriques de Performance",
      "items": {
        "pageWeight": "• Poids de page cible : < 100KB par page",
        "httpRequests": "• Requêtes HTTP minimales grâce à des ressources consolidées",
        "tracking": "• Aucun script de suivi ou d'analyse externe",
        "caching": "• Stratégies de mise en cache agressives pour le contenu statique",
        "markup": "• Le balisage sémantique réduit la complexité du DOM"
      }
    },
    "futureGoals": {
      "title": "Objectifs Futurs d'Éco-conception",
      "description": "Les versions suivantes maintiendront ces principes d'efficacité fondamentaux tout en introduisant les fonctionnalités nécessaires :",
      "items": {
        "monitoring": "• Surveillance continue du poids des pages et des performances",
        "carbonFootprint": "• Évaluation de l'empreinte carbone pour les opérations de la plateforme",
        "optimization": "• Optimisation de toutes les fonctionnalités dynamiques introduites dans V2+",
        "hosting": "• Sélection d'une infrastructure d'hébergement économe en énergie"
      }
    },
    "userContribution": {
      "title": "Contribution de l'Utilisateur",
      "description": "Les utilisateurs contribuent à l'éco-conception en expérimentant une plateforme à chargement rapide et à faible bande passante qui respecte à la fois leur temps et les ressources environnementales. La simplicité structurelle de V1 démontre que des expériences numériques efficaces n'ont pas besoin de s'appuyer sur un design gourmand en ressources."
    }
  },
  "accessibility": {
    "title": "Déclaration d'Accessibilité",
    "commitment": {
      "title": "Engagement envers l'Accessibilité",
      "paragraph1": "LexOrbital s'engage à assurer l'accessibilité numérique pour tous les utilisateurs, y compris ceux ayant des handicaps. Nous nous efforçons de respecter les normes WCAG 2.1 Niveau AA comme notre référence minimale.",
      "paragraph2": "L'architecture V1 a été conçue avec une clarté structurelle et un HTML sémantique pour supporter les technologies d'assistance et assurer une navigation accessible."
    },
    "features": {
      "title": "Fonctionnalités d'Accessibilité (V1)",
      "items": {
        "semantic": "• Structure HTML sémantique avec une hiérarchie de titres appropriée",
        "contrast": "• Schéma de couleurs noir et blanc à haut contraste (ratio 21:1)",
        "keyboard": "• Interface navigable au clavier",
        "focus": "• Indicateurs de focus clairs sur les éléments interactifs",
        "labels": "• Labels descriptifs et attributs ARIA appropriés",
        "navigation": "• Structure de navigation cohérente sur toutes les pages"
      }
    },
    "limitations": {
      "title": "Limitations Connues",
      "description": "En tant que prototype V1, certaines fonctionnalités d'accessibilité restent en développement :",
      "items": {
        "screenReader": "• Optimisation des lecteurs d'écran en cours",
        "altText": "• Texte alternatif pour les éléments visuels de placeholder pas encore complet",
        "responsive": "• Design responsive pour les lecteurs d'écran mobiles nécessite une amélioration"
      }
    },
    "feedback": {
      "title": "Retour et Assistance",
      "description": "Nous accueillons les retours sur les problèmes d'accessibilité ou les obstacles rencontrés lors de l'utilisation de la plateforme. Veuillez utiliser le formulaire de contact pour signaler toute préoccupation d'accessibilité, et nous travaillerons à les résoudre dans les itérations futures."
    },
    "improvements": {
      "title": "Améliorations Continues",
      "description": "L'accessibilité est une priorité évolutive. Chaque version de LexOrbital intégrera des fonctionnalités d'accessibilité améliorées basées sur les retours des utilisateurs et les normes mises à jour."
    }
  },
  "disclosure": {
    "title": "Divulgation Légale et Transparence",
    "company": {
      "title": "Informations sur l'Entreprise",
      "items": {
        "legalEntity": {
          "label": "Entité Légale :",
          "value": "LexOrbital SAS"
        },
        "registrationNumber": {
          "label": "Numéro d'Enregistrement :",
          "value": "XXX XXX XXX RCS Paris"
        },
        "vatNumber": {
          "label": "Numéro de TVA :",
          "value": "FR XX XXX XXX XXX"
        },
        "headquarters": {
          "label": "Siège Social :",
          "value": "Paris, France"
        },
        "publicationDirector": {
          "label": "Directeur de Publication :",
          "value": "[Nom], PDG"
        }
      }
    },
    "hosting": {
      "title": "Hébergement et Infrastructure",
      "primaryHosting": {
        "title": "Hébergement Principal",
        "description": "Amazon Web Services (AWS)<br />Centres de données : EU-West-1 (Irlande), EU-Central-1 (Francfort)<br />Conformité : ISO 27001, SOC 2 Type 2, RGPD"
      },
      "cdn": {
        "title": "CDN et Edge Computing",
        "description": "Cloudflare, Inc.<br />Réseau edge mondial avec résidence de données européenne<br />Sécurité : protection DDoS, WAF, chiffrement SSL/TLS"
      },
      "backup": {
        "title": "Sauvegarde et Reprise après Sinistre",
        "description": "Redondance géographique sur plusieurs régions UE<br />RTO : 4 heures | RPO : 15 minutes<br />Sauvegardes chiffrées avec versioning"
      }
    },
    "intellectualProperty": {
      "title": "Propriété Intellectuelle",
      "platform": {
        "title": "Plateforme LexOrbital",
        "paragraph1": "Tous droits réservés. La plateforme LexOrbital, y compris son cadre d'architecture modulaire, son moteur de visualisation et ses algorithmes propriétaires sont protégés par le droit d'auteur et le secret commercial.",
        "paragraph2": "La reproduction, modification ou exploitation commerciale non autorisée est interdite et peut entraîner des poursuites judiciaires."
      },
      "openSource": {
        "title": "Composants Open Source",
        "description": "LexOrbital intègre des logiciels open source régis par leurs licences respectives. L'attribution complète et les informations de licence sont disponibles sur notre page Références.",
        "licenses": "• React (Licence MIT)<br />• Tailwind CSS (Licence MIT)<br />• TypeScript (Licence Apache 2.0)<br />• Dépendances supplémentaires listées dans package.json"
      },
      "trademarks": {
        "title": "Marques",
        "description": "\"LexOrbital\" et le logo LexOrbital sont des marques de commerce de LexOrbital SAS. L'utilisation de ces marques sans autorisation est interdite."
      }
    },
    "security": {
      "title": "Divulgation Responsable — Vulnérabilités de Sécurité",
      "description": "LexOrbital s'engage envers la sécurité et accueille favorablement la divulgation responsable des vulnérabilités.",
      "reporting": {
        "title": "Processus de Signalement",
        "step1": {
          "label": "1. Signaler via un canal sécurisé :",
          "email": "Email :",
          "emailValue": "security@lexorbital.com",
          "emailLabel": "Envoyer un email à security@lexorbital.com",
          "pgp": "Clé PGP disponible sur notre page Sécurité"
        },
        "step2": {
          "label": "2. Inclure les détails :",
          "items": {
            "description": "• Description de la vulnérabilité et évaluation de l'impact",
            "steps": "• Étapes pour reproduire",
            "proof": "• Preuve de concept (si applicable)",
            "contact": "• Vos informations de contact pour le suivi"
          }
        },
        "step3": {
          "label": "3. Réponse attendue :",
          "items": {
            "acknowledgment": "• Accusé de réception dans les 48 heures",
            "assessment": "• Évaluation initiale dans les 5 jours ouvrables",
            "updates": "• Mises à jour régulières tout au long du processus de correction"
          }
        }
      },
      "safeHarbor": {
        "title": "Safe Harbor",
        "description": "Nous ne poursuivrons pas d'action en justice contre les chercheurs en sécurité qui :",
        "items": {
          "goodFaith": "• Signalent les vulnérabilités de bonne foi",
          "privacy": "• Évitent les violations de la vie privée et la destruction de données",
          "exploit": "• N'exploitent pas les vulnérabilités au-delà de la preuve de concept",
          "time": "• Permettent un délai raisonnable pour la correction avant la divulgation publique"
        }
      },
      "recognition": {
        "title": "Reconnaissance",
        "description": "Avec votre permission, nous reconnaîtrons votre contribution dans notre Hall of Fame de Sécurité (voir page Sécurité)."
      }
    },
    "limitations": {
      "title": "Limitations et Avertissements",
      "items": {
        "availability": {
          "label": "Disponibilité du Service :",
          "description": "Bien que nous visions 99,9% de disponibilité, LexOrbital est fourni \"tel quel\" sans garantie de service ininterrompu. Les fenêtres de maintenance planifiées sont annoncées 72 heures à l'avance."
        },
        "accuracy": {
          "label": "Exactitude des Données :",
          "description": "Les visualisations d'architecture sont générées à partir de données fournies par l'utilisateur. LexOrbital ne garantit pas l'exactitude ou l'exhaustivité des visualisations."
        },
        "thirdParty": {
          "label": "Services Tiers :",
          "description": "Les intégrations avec des outils tiers sont soumises à leur disponibilité et à leurs conditions de service. LexOrbital n'est pas responsable des défaillances des services tiers."
        },
        "professional": {
          "label": "Conseil Professionnel :",
          "description": "LexOrbital est un outil technique, pas un substitut à une consultation architecturale professionnelle, des conseils juridiques ou des services d'audit de sécurité."
        }
      }
    },
    "dispute": {
      "title": "Résolution des Litiges",
      "governingLaw": {
        "title": "Droit Applicable",
        "description": "Ces conditions et tout litige découlant de l'utilisation de LexOrbital sont régis par le droit français."
      },
      "mediation": {
        "title": "Médiation",
        "description": "En cas de litige, les parties conviennent de tenter une médiation de bonne foi avant les procédures judiciaires. Contactez notre service juridique pour initier la médiation."
      },
      "jurisdiction": {
        "title": "Juridiction",
        "description": "Juridiction exclusive pour les procédures judiciaires : Tribunaux de Commerce de Paris, France."
      }
    },
    "contact": {
      "title": "Contact pour les Questions Juridiques",
      "legal": {
        "label": "Service Juridique",
        "email": "legal@lexorbital.com",
        "emailLabel": "Envoyer un email au service juridique"
      },
      "security": {
        "label": "Équipe de Sécurité",
        "email": "security@lexorbital.com",
        "emailLabel": "Envoyer un email à l'équipe de sécurité"
      },
      "privacy": {
        "label": "Responsable de la Protection des Données",
        "email": "privacy@lexorbital.com",
        "emailLabel": "Envoyer un email au responsable de la protection des données"
      }
    }
  },
  "ethics": {
    "title": "Charte Éthique et Déontologique",
    "corePrinciples": {
      "title": "Principes Éthiques Fondamentaux",
      "description": "LexOrbital fonctionne selon les principes de transparence, de respect de l'utilisateur et de développement technologique responsable. Cette charte décrit nos engagements éthiques et nos obligations déontologiques."
    },
    "transparency": {
      "title": "1. Transparence et Honnêteté",
      "architectural": {
        "title": "Transparence Architecturale",
        "description": "Toutes les structures système, relations entre modules et décisions architecturales sont documentées et rendues visibles aux utilisateurs. Aucune fonctionnalité cachée ou opération opaque."
      },
      "honest": {
        "title": "Représentation Honnête",
        "description": "V1 est clairement identifiée comme un prototype conceptuel. Les éléments placeholder sont explicitement étiquetés. Les capacités futures sont marquées comme telles, pas présentées comme des fonctionnalités actuelles."
      }
    },
    "privacy": {
      "title": "2. Vie Privée et Protection des Données",
      "minimal": {
        "title": "Collecte Minimale de Données",
        "description": "V1 ne collecte aucune donnée utilisateur, ne stocke aucune information personnelle et n'utilise aucun mécanisme de suivi. Ce principe guidera toutes les versions futures."
      },
      "byDesign": {
        "title": "Vie Privée par Conception",
        "description": "Les considérations de vie privée sont intégrées dans la fondation architecturale, pas ajoutées après coup."
      }
    },
    "accessibility": {
      "title": "3. Accessibilité et Inclusion",
      "universal": {
        "title": "Accès Universel",
        "description": "La plateforme est conçue pour être accessible aux utilisateurs de toutes capacités, avec un haut contraste, une structure sémantique et une navigation au clavier comme éléments fondamentaux."
      },
      "language": {
        "title": "Neutralité Linguistique",
        "description": "Bien que V1 utilise l'anglais/français, l'approche structurelle est indépendante de la langue, facilitant l'internationalisation future."
      }
    },
    "environmental": {
      "title": "4. Responsabilité Environnementale",
      "description": "La durabilité numérique est une obligation éthique fondamentale. L'approche de design minimaliste reflète notre engagement à réduire l'impact environnemental grâce à un code efficace, des ressources minimales et des choix techniques réfléchis."
    },
    "integrity": {
      "title": "5. Intégrité Intellectuelle",
      "attribution": {
        "title": "Attribution et Reconnaissance",
        "description": "Toutes les contributions externes, influences et références sont correctement documentées et créditées."
      },
      "documentation": {
        "title": "Documentation Ouverte",
        "description": "La documentation technique et les décisions architecturales sont ouvertement partagées pour contribuer à la connaissance collective."
      }
    },
    "userAgency": {
      "title": "6. Autonomie et Contrôle de l'Utilisateur",
      "description": "Les utilisateurs conservent un contrôle total sur leur interaction avec la plateforme. Aucun pattern de design manipulateur, dark pattern ou élément coercitif. Une navigation claire et une fonctionnalité explicite respectent l'autonomie de l'utilisateur."
    },
    "enforcement": {
      "title": "Application et Responsabilité",
      "description": "Cette charte guide toutes les décisions de développement et les implémentations de fonctionnalités. Les violations de ces principes sont prises au sérieux et traitées par :",
      "items": {
        "audits": "• Audits éthiques réguliers des fonctionnalités de la plateforme",
        "feedback": "• Mécanismes de retour utilisateur pour les préoccupations éthiques",
        "documentation": "• Documentation transparente de la prise de décision éthique",
        "refinement": "• Raffinement continu des lignes directrices éthiques"
      }
    },
    "evolution": {
      "title": "Évolution de l'Éthique",
      "description": "Cette charte évoluera avec la plateforme. Au fur et à mesure que de nouvelles fonctionnalités sont introduites, les considérations éthiques seront documentées et intégrées dans le processus de développement. Les retours des utilisateurs et les normes éthiques émergentes informeront les mises à jour de cette charte."
    }
  },
  "security": {
    "title": "Sécurité",
    "overview": {
      "title": "Sécurité chez LexOrbital",
      "paragraph1": "La sécurité est fondamentale pour l'architecture et les opérations de LexOrbital. Nous mettons en œuvre des stratégies de défense en profondeur à travers toutes les couches de notre plateforme pour protéger les données utilisateur et maintenir l'intégrité du service.",
      "paragraph2": "Cette page fournit de la transparence sur nos pratiques de sécurité et offre des canaux pour que les chercheurs en sécurité et les utilisateurs signalent des vulnérabilités."
    },
    "vulnerabilityDisclosure": {
      "title": "Programme de Divulgation de Vulnérabilités",
      "howToReport": {
        "title": "Comment Signaler une Vulnérabilité de Sécurité",
        "secureCommunication": {
          "title": "1. Communication Sécurisée",
          "description": "Signaler les problèmes de sécurité par email chiffré :",
          "email": "security@lexorbital.com",
          "emailLabel": "Envoyer un email à security@lexorbital.com",
          "pgpNote": "Pour les rapports sensibles, utilisez notre clé PGP (disponible ci-dessous)"
        },
        "whatToInclude": {
          "title": "2. Ce qu'il faut Inclure",
          "items": {
            "description": "• Description détaillée de la vulnérabilité",
            "steps": "• Instructions de reproduction étape par étape",
            "impact": "• Évaluation de l'impact potentiel (score CVSS si disponible)",
            "proof": "• Preuve de concept (code, captures d'écran ou vidéo)",
            "contact": "• Vos informations de contact pour le suivi",
            "timeline": "• Calendrier de divulgation préféré"
          }
        },
        "responseTimeline": {
          "title": "3. Calendrier de Réponse",
          "initialResponse": {
            "label": "Réponse Initiale",
            "value": "48h"
          },
          "assessment": {
            "label": "Évaluation",
            "value": "5 jours"
          },
          "remediationCritical": {
            "label": "Correction (Critique)",
            "value": "30 jours"
          },
          "remediationMedium": {
            "label": "Correction (Moyenne)",
            "value": "90 jours"
          }
        }
      }
    },
    "scope": {
      "title": "Portée et Règles d'Engagement",
      "inScope": {
        "title": "Dans la Portée",
        "items": {
          "domain": "✓ lexorbital.com et tous les sous-domaines",
          "api": "✓ Points de terminaison API (api.lexorbital.com)",
          "mobile": "✓ Applications mobiles (si applicable)",
          "trustCenter": "✓ Infrastructure du Centre de confiance"
        }
      },
      "outOfScope": {
        "title": "Hors de la Portée",
        "items": {
          "socialEngineering": "✗ Ingénierie sociale des employés",
          "physical": "✗ Attaques physiques sur l'infrastructure",
          "dos": "✗ Attaques par déni de service (DoS/DDoS)",
          "thirdParty": "✗ Services tiers que nous ne contrôlons pas",
          "spam": "✗ Spam ou manipulation des en-têtes email"
        }
      },
      "rules": {
        "title": "Règles d'Engagement",
        "items": {
          "data": "• Ne pas accéder, modifier ou supprimer des données utilisateur au-delà de la preuve de concept",
          "accounts": "• Limiter les tests à vos propres comptes lorsque possible",
          "exploit": "• Ne pas exploiter les vulnérabilités à des fins personnelles",
          "privacy": "• Respecter la vie privée des utilisateurs et les réglementations de protection des données",
          "disclosure": "• Fournir un délai raisonnable pour la correction avant la divulgation publique",
          "goodFaith": "• Agir de bonne foi pour éviter les perturbations de service"
        }
      }
    },
    "bugBounty": {
      "title": "Programme Bug Bounty",
      "description": "Nous récompensons les chercheurs en sécurité qui nous aident à identifier des vulnérabilités.",
      "table": {
        "headers": {
          "severity": "Sévérité",
          "cvss": "Score CVSS",
          "examples": "Exemples",
          "reward": "Gamme de Récompense"
        },
        "rows": {
          "critical": {
            "severity": "Critique",
            "cvss": "9.0 - 10.0",
            "examples": "RCE, Injection SQL, Bypass d'authentification",
            "reward": "2 000 € - 5 000 €"
          },
          "high": {
            "severity": "Élevée",
            "cvss": "7.0 - 8.9",
            "examples": "XSS (stocké), CSRF, IDOR",
            "reward": "500 € - 2 000 €"
          },
          "medium": {
            "severity": "Moyenne",
            "cvss": "4.0 - 6.9",
            "examples": "XSS (réfléchi), Divulgation d'informations",
            "reward": "100 € - 500 €"
          },
          "low": {
            "severity": "Faible",
            "cvss": "0.1 - 3.9",
            "examples": "Mauvaises configurations de sécurité",
            "reward": "50 € - 100 €"
          }
        }
      },
      "note": "* Les récompenses sont déterminées en fonction de la sévérité, de la qualité du rapport et de la nouveauté. Les rapports en double reçoivent des récompenses réduites sur la base du premier arrivé."
    },
    "hallOfFame": {
      "title": "Hall of Fame de Sécurité",
      "description": "Nous remercions les chercheurs en sécurité suivants pour leur divulgation responsable :",
      "researchers": {
        "alice": {
          "name": "Alice Chen — Déc 2024",
          "description": "Critique : Vulnérabilité de bypass d'authentification"
        },
        "bob": {
          "name": "Bob Mueller — Nov 2024",
          "description": "Élevée : XSS stocké dans les annotations de modules"
        },
        "carol": {
          "name": "Carol Zhang — Oct 2024",
          "description": "Moyenne : Divulgation d'informations dans les réponses API"
        }
      },
      "more": "Plus de chercheurs seront ajoutés au fur et à mesure que les rapports sont résolus"
    },
    "pgp": {
      "title": "Clé Publique PGP",
      "description": "Pour les communications chiffrées, utilisez notre clé publique PGP :",
      "key": "-----BEGIN PGP PUBLIC KEY BLOCK-----\n\nmQINBGXYZ1cBEAC9... [tronqué pour l'affichage]\n[Clé PGP complète disponible via téléchargement]\n\n-----END PGP PUBLIC KEY BLOCK-----",
      "download": "Télécharger la Clé PGP Complète",
      "verify": "Vérifier l'Empreinte de la Clé"
    },
    "bestPractices": {
      "title": "Meilleures Pratiques de Sécurité pour les Utilisateurs",
      "accountSecurity": {
        "title": "Sécurité du Compte",
        "items": {
          "2fa": "• Activer l'authentification à deux facteurs (2FA)",
          "password": "• Utiliser des mots de passe forts et uniques (minimum 12 caractères)",
          "sessions": "• Examiner régulièrement les sessions actives et les applications autorisées",
          "credentials": "• Ne jamais partager vos identifiants ou clés API"
        }
      },
      "dataProtection": {
        "title": "Protection des Données",
        "items": {
          "classify": "• Classifier vos données de manière appropriée avant le téléchargement",
          "rbac": "• Utiliser des contrôles d'accès basés sur les rôles (RBAC) pour les membres de l'équipe",
          "audit": "• Auditer régulièrement qui a accès aux architectures sensibles",
          "logging": "• Activer l'enregistrement d'audit pour les exigences de conformité"
        }
      },
      "suspiciousActivity": {
        "title": "Activité Suspecte",
        "items": {
          "report": "• Signaler immédiatement toute activité de compte inhabituelle",
          "verify": "• Vérifier l'authenticité de l'email (vérifier le domaine de l'expéditeur)",
          "phishing": "• Être prudent face aux tentatives de phishing imitant LexOrbital",
          "contact": "• Contacter le support si vous suspectez un incident de sécurité"
        }
      }
    },
    "resources": {
      "title": "Ressources de Sécurité",
      "reportVulnerability": "Signaler une Vulnérabilité",
      "viewTrustCenter": "Voir le Centre de Confiance",
      "advisories": "Avis de Sécurité",
      "certifications": "Certifications de Conformité"
    }
  }
}
